Neel-729/DeskDroid/firmware/esp32/src/app/application.cpp
bool screenNeedsPeriodicRefresh(AppState state){
  switch(state){
    case STATE_CLOCK:
      return true;

    case STATE_TIMER_VIEW:
      return TimerFeature::isRunning();

    case STATE_TIMER_EDIT:
    case STATE_REMINDER_EDIT:
      return shouldBlinkCurrentScreen();

    case STATE_STOPWATCH:
      return StopwatchFeature::isRunning();

    case STATE_SETTINGS_EDIT:
      return SettingsFlow::shouldBlink();

    default:
      return false;
  }
}

bool shouldBuildUiFrame(unsigned long now, bool stateChanged){
  if(stateChanged) return true;
  if(blinkDue(now)) return true;
  if(!screenNeedsPeriodicRefresh(AppNavigation::current())) return false;
  return now - systemContext.ui.lastRefreshMs > 250;
}

bool updateBlinkState(unsigned long now){
  if(!shouldBlinkCurrentScreen()) return false;
  if(now-systemContext.ui.lastBlinkMs>500){
    systemContext.ui.blinkState=!systemContext.ui.blinkState;
    systemContext.ui.lastBlinkMs=now;
    return true;
  }
  return false;
}

void startReminderAlarm(uint8_t idx, unsigned long now){
  AppNavigation::setResumeAfterReminder(AppNavigation::current());
  AppCommands::setLedMode(LED_REMINDER_ALARM);
  RemindersFeature::startAlarm(idx, now);
  AppNavigation::enter(STATE_REMINDER_ALARM);
}

void stopReminderAlarm(){
  AppState resumeState = AppNavigation::resumeAfterReminder();
  RemindersFeature::stopAlarm();
  AppCommands::setLedMode(resumeState==STATE_TIMER_ALARM ? LED_TIMER_ALARM : LED_IDLE);
  AppNavigation::enter(resumeState);
}

void checkReminders(){
  RemindersFeature::check(AppNavigation::current()==STATE_REMINDER_ALARM);
}

void updateReminderAlarm(unsigned long now){
  if(AppNavigation::current()!=STATE_REMINDER_ALARM) return;
  if(RemindersFeature::updateAlarm(now)){
    AudioService::beep(80);
  }
}

void resetTimerAlarm(bool restoreDuration){
  AppCommands::setLedMode(LED_IDLE);
  TimerFeature::confirmReset();
  AppNavigation::enter(STATE_TIMER_VIEW);
}

void checkTimerDone(unsigned long now){
  if(AppNavigation::current()==STATE_TIMER_ALARM) return;
  TimerFeature::update(now);
}

void handleEvent(const AppEvent &event, unsigned long now){
  EventType ev = event.type;
  DeviceSettings &settings = SettingsFlow::settings();

  // STAGE 5: Log application receiving the event
  if(ev == EVENT_CLICK || ev == EVENT_DOUBLE_CLICK || ev == EVENT_LONG_PRESS){
    Serial.printf("[APP] event=%d\n", ev);
  }

  // Track user activity for idle manager
  if(ev == EVENT_CLICK || ev == EVENT_DOUBLE_CLICK || ev == EVENT_LONG_PRESS ||
     ev == EVENT_ROTATE_CW || ev == EVENT_ROTATE_CCW){
    IdleManager::notifyActivity(now);
  }

  switch(ev){
    case EVENT_TIMER_DONE:
      AppCommands::setLedMode(LED_TIMER_ALARM);
      AppNavigation::enter(STATE_TIMER_ALARM);
      return;

    case EVENT_TIMER_ALARM_TIMEOUT:
      resetTimerAlarm(false);
      return;

    case EVENT_REMINDER_TRIGGER:
      startReminderAlarm(event.payload.reminder.index, now);
      return;

    case EVENT_REMINDER_TIMEOUT:
      stopReminderAlarm();
      return;

    default:
      break;
  }

  if(AppNavigation::current()==STATE_REMINDER_ALARM){
    if(ev==EVENT_CLICK || ev==EVENT_DOUBLE_CLICK || ev==EVENT_LONG_PRESS){
      stopReminderAlarm();
    }
    return;
  }

  // Handle long press to go home
  if(ev == EVENT_LONG_PRESS){
    LOG_INFO(LogTag::APP, "[NAV] Long press home triggered");
    AppNavigation::goHome();
    AudioService::beep(200);  // Distinct beep for long press home
    return;
  }

  if(ev==EVENT_ROTATE_CW || ev==EVENT_ROTATE_CCW){
    int step = event.payload.encoder.direction;
    if(step == 0) step = (ev==EVENT_ROTATE_CW)?1:-1;

    switch(AppNavigation::current()){
      case STATE_REMINDER_LIST:
        RemindersFeature::rotateSelected(step);
        AppNavigation::markChanged();
        AudioService::beep(20);
        break;

      case STATE_REMINDER_EDIT:
        RemindersFeature::adjustSelected(step);
        RemindersFeature::save();
        AppNavigation::markChanged();
        AudioService::beep(20);
        break;

      case STATE_TIMER_EDIT:
        AppCommands::adjustTimerEdit(step);
        AppNavigation::markChanged();
        break;

      case STATE_SETTINGS_MENU:
        SettingsFlow::rotateMenu(step);
        break;

      case STATE_SETTINGS_EDIT:
        SettingsFlow::adjustValue(step);
        break;

      case STATE_CLOCK:
      case STATE_TIMER_VIEW:
        // === REMOVED QUICK PAUSED EDIT: Paused state now does normal screen navigation
        // Rotate between main screens regardless of timer state (IDLE/RUNNING/PAUSED)
        AppNavigation::rotateMainState(step);
        AudioService::beep(20);
        break;

      case STATE_STOPWATCH:
      case STATE_REMINDER_HOME:
      case STATE_SETTINGS_HOME:
        AppNavigation::rotateMainState(step);
        AudioService::beep(20);
        break;

      default:
        break;
    }
  }

  if(ev==EVENT_CLICK){
    switch(AppNavigation::current()){
      case STATE_CLOCK:
        ClockFeature::nextQuote(now);
        break;

      case STATE_TIMER_VIEW:
        {
          // === FIXED: Corrected IDLE state single click behavior
          // Single click handling per timer state:
          // - IDLE: enterRunning() (start timer)
          // - RUNNING: enterPaused()
          // - PAUSED: enterRunning() (resume)
          // - COMPLETE: enterEditing()
          if(TimerFeature::isRunning()){
            TimerFeature::enterPaused(now);
          } else if(TimerFeature::isPaused()){
            TimerFeature::enterRunning(now);
          } else if(TimerFeature::isComplete()){
            // COMPLETE: enter editing mode to set new time
            TimerFeature::enterEditing();
            AppNavigation::enter(STATE_TIMER_EDIT);
          } else {
            // IDLE: start the timer
            TimerFeature::enterRunning(now);
          }
        }
        break;

      case STATE_TIMER_EDIT:
        AppCommands::advanceTimerEditField();
        AppNavigation::markChanged();
        break;

      case STATE_TIMER_ALARM:
        resetTimerAlarm(true);
        break;

      case STATE_STOPWATCH:
        {
          // Single press handling per stopwatch state (exact spec):
          // - IDLE: Start
          // - RUNNING: Pause
          // - PAUSED: Resume
          const auto& stopwatch = SystemStateStore::current().stopwatch;
          if (stopwatch.state == StopwatchStateValue::RUNNING) {
            StopwatchFeature::stop(now);
          } else if (stopwatch.state == StopwatchStateValue::PAUSED) {
            StopwatchFeature::resume(now);
          } else {
            StopwatchFeature::start(now);
          }
        }
        break;

      case STATE_REMINDER_HOME:
        AppNavigation::enter(STATE_REMINDER_LIST);
        break;

