Neel-729/DeskDroid/firmware/esp32/src/app/application.cpp
UiScreens::TimerScreenData timerScreenData(unsigned long now){
  UiScreens::TimerScreenData data = {
    TimerFeature::isRunning(),
    TimerFeature::totalMillis(),
    TimerFeature::remainingMillis(now),
    TimerFeature::hours(),
    TimerFeature::minutes(),
    TimerFeature::seconds(),
    (uint8_t)TimerFeature::editField()
  };
  return data;
}

UiScreens::StopwatchScreenData stopwatchScreenData(){
  UiScreens::StopwatchScreenData data = {
    StopwatchFeature::elapsed()
  };
  return data;
}

UiScreens::RemindersScreenData remindersScreenData(){
  uint8_t nextHour = 0;
  uint8_t nextMinute = 0;
  bool hasNext = RemindersFeature::getNext(nextHour, nextMinute);

  UiScreens::RemindersScreenData data = {
    RemindersFeature::MAX_REMINDERS,
    RemindersFeature::selectedIndex(),
    RemindersFeature::selectedActive(),
    RemindersFeature::selectedHour(),
    RemindersFeature::selectedMinute(),
    (uint8_t)RemindersFeature::editField(),
    hasNext,
    nextHour,
    nextMinute,
    RemindersFeature::activeAlarmIndex(),
    RemindersFeature::activeAlarmHour(),
    RemindersFeature::activeAlarmMinute()
  };
  return data;
}

void runBuzzerTask(FrameContext &context){
  (void)context;
  AudioService::service();
}

void runEsp8266LinkTask(FrameContext &context){
  Services::update(context.nowMs);
}

void runHardwareRequestTask(FrameContext &context){
  (void)context;
  HardwareRequests::executePending();
}

void runLightingTask(FrameContext &context){
  (void)context;
  DeviceSettings &settings = SettingsFlow::settings();
  LightingService::refreshSchedule(settings);
}

void runTimerTask(FrameContext &context){
  const unsigned long now = context.nowMs;

  if(AppNavigation::current()==STATE_TIMER_ALARM && TimerFeature::shouldAlarmBeep(now)){
    AudioService::beep(200);
  }
  if(AppNavigation::current()==STATE_TIMER_ALARM && TimerFeature::alarmTimedOut(now)){
    enqueueTimerEvent(EVENT_TIMER_ALARM_TIMEOUT);
  }

  TimerService::update(now);
}

void runReminderCheckTask(FrameContext &context){
  (void)context;
  checkReminders();
}

void runReminderAlarmTask(FrameContext &context){
  updateReminderAlarm(context.nowMs);
}

void runNavMonitorTask(FrameContext &context){
  // Navigation monitoring removed - button handling now centralized in EncoderDriver
}

void runInputTask(FrameContext &context){
  (void)context;
  EventType inputEvent=InputService::readEvent();
  if(inputEvent!=EVENT_NONE){
    int8_t direction = 0;
    if(inputEvent==EVENT_ROTATE_CW) direction = 1;
    else if(inputEvent==EVENT_ROTATE_CCW) direction = -1;
    enqueueEncoderEvent(inputEvent, direction);
  }
}

void runEventTask(FrameContext &context){
  if(processEvents(context.nowMs)){
    runLightingTask(context);
  }
  
  // Check for idle timeout and auto-return to dashboard
  if(IdleManager::update(context.nowMs)){
    // Idle timeout reached - return to home
    if(!AppNavigation::isAtHome()){
      Serial.println("[HOME RESET] Auto-return to dashboard triggered");
      LOG_INFO(LogTag::APP, "[IDLE] Auto-return to dashboard triggered");
      AppNavigation::goHome();
      AudioService::beep(150);  // Short beep for auto-return
    }
  }
}

void runUiTask(FrameContext &context){
  AppNavigation::commit();
  const uint32_t frameStartUs = micros();
  const unsigned long now = context.nowMs;
  DeviceSettings &settings = SettingsFlow::settings();

  uiTiming.decisionUs = 0;
  uiTiming.dataUs = 0;
  uiTiming.menuDrawingUs = 0;
  uiTiming.textRenderingUs = 0;
  uiTiming.iconRenderingUs = 0;
  uiTiming.animationRenderingUs = 0;
  uiTiming.displayRenderingUs = 0;
  uiTiming.spiTransferUs = 0;
  uiTiming.frameUs = 0;

  const uint32_t decisionStartUs = micros();
  const bool stateChanged = AppNavigation::hasStateChanged();
  const bool buildFrame = shouldBuildUiFrame(now, stateChanged);
  uiTiming.decisionUs = micros() - decisionStartUs;

  if(!buildFrame){
    uiTiming.framesSkipped++;
    uiTiming.frameUs = micros() - frameStartUs;
    return;
  }

  if(stateChanged){
    AppNavigation::clearStateChanged();
  }

  const uint32_t blinkStartUs = micros();
  (void)updateBlinkState(now);
  uiTiming.animationRenderingUs += micros() - blinkStartUs;

  const AppState currentState = AppNavigation::current();
  uiTiming.framesBuilt++;

  switch(currentState){
    case STATE_CLOCK: {
      const uint32_t animationStartUs = micros();
      ClockFeature::update(now,settings.quotes,settings.format24);
      uiTiming.animationRenderingUs += micros() - animationStartUs;

      const uint32_t renderStartUs = micros();
      UiScreens::renderClockScreen(ClockFeature::timeRow(),ClockFeature::quoteRow());
      uiTiming.textRenderingUs += micros() - renderStartUs;
      break;
    }

    case STATE_TIMER_VIEW:
    case STATE_TIMER_EDIT:
    case STATE_TIMER_ALARM: {
      const uint32_t dataStartUs = micros();
      UiScreens::TimerScreenData data = timerScreenData(now);
      uiTiming.dataUs += micros() - dataStartUs;

      const uint32_t renderStartUs = micros();
      UiScreens::renderTimerScreen(currentState,data,systemContext.ui.blinkState);
      uiTiming.textRenderingUs += micros() - renderStartUs;
      break;
    }

    case STATE_STOPWATCH: {
      const uint32_t animationStartUs = micros();
      StopwatchFeature::update(now);
      uiTiming.animationRenderingUs += micros() - animationStartUs;

      const uint32_t dataStartUs = micros();
      UiScreens::StopwatchScreenData data = stopwatchScreenData();
      uiTiming.dataUs += micros() - dataStartUs;

      const uint32_t renderStartUs = micros();
      UiScreens::renderStopwatchScreen(data);
      uiTiming.textRenderingUs += micros() - renderStartUs;
      break;
    }

    case STATE_REMINDER_HOME:
    case STATE_REMINDER_LIST:
    case STATE_REMINDER_EDIT: {
      const uint32_t dataStartUs = micros();
      UiScreens::RemindersScreenData data = remindersScreenData();
      uiTiming.dataUs += micros() - dataStartUs;

      const uint32_t renderStartUs = micros();
      UiScreens::renderRemindersScreen(currentState,data,settings.format24,systemContext.ui.blinkState);
      uiTiming.menuDrawingUs += micros() - renderStartUs;
      break;
    }

    case STATE_SETTINGS_HOME:
    case STATE_SETTINGS_MENU:
    case STATE_SETTINGS_EDIT: {
      const uint32_t dataStartUs = micros();
      SettingsFlow::Snapshot snapshot = SettingsFlow::snapshot(FIRMWARE_VERSION,systemContext.ui.blinkState);
      uiTiming.dataUs += micros() - dataStartUs;

      const uint32_t renderStartUs = micros();
      UiScreens::renderSettingsScreen(currentState,settings,snapshot);
      uiTiming.menuDrawingUs += micros() - renderStartUs;
      break;
    }

    case STATE_REMINDER_ALARM: {
      const uint32_t dataStartUs = micros();
      UiScreens::RemindersScreenData data = remindersScreenData();
      uiTiming.dataUs += micros() - dataStartUs;

      const uint32_t renderStartUs = micros();
      UiScreens::renderReminderAlarmScreen(data);
      uiTiming.textRenderingUs += micros() - renderStartUs;
      break;
    }
  }

