Neel-729/DeskDroid/firmware/esp32/src/app/application.cpp
  const uint32_t displayStartUs = micros();
  const bool flushed = flushUiFrame(false);
  uiTiming.displayRenderingUs = micros() - displayStartUs;
  if(!flushed){
    uiTiming.unnecessaryRedraws++;
  }
  systemContext.ui.lastRefreshMs=now;
  uiTiming.frameUs = micros() - frameStartUs;
  if(uiTiming.frameUs > uiTiming.maxFrameUs){
    uiTiming.maxFrameUs = uiTiming.frameUs;
  }
}

void runDiagnosticsTask(FrameContext &context){
  static uint32_t lastLedPerfMs = 0;
  static uint32_t lastLedPerfTx = 0;
  static uint32_t lastLedPerfAck = 0;
  static uint32_t lastLedPerfRetry = 0;
  static uint32_t lastLedPerfUartTxBytes = 0;

  const SchedulerStats &schedulerStats = scheduler.stats();
  const HardwareRequestStats &hardwareStats = HardwareRequests::stats();
  const EventQueueStats &eventStats = eventQueueStats();
  const FaultSnapshot &faults = FaultTracker::snapshot();
  const FaultRecord &lastFault = faults.lastFault;
  const Esp8266LinkDiagnostics &link = Esp8266Link::diagnostics();
  const UartMonitorStats &uart = UartTrafficMonitor::stats();
  const uint32_t ledPerfElapsedMs = lastLedPerfMs == 0 ? 0 : context.nowMs - lastLedPerfMs;
  const uint32_t ledTxDelta = link.ledTx - lastLedPerfTx;
  const uint32_t ledAckDelta = link.ledAck - lastLedPerfAck;
  const uint32_t ledRetryDelta = link.ledRetry - lastLedPerfRetry;
  const uint32_t uartTxByteDelta = uart.txBytes - lastLedPerfUartTxBytes;
  const uint32_t ledTxPerMinute =
    ledPerfElapsedMs == 0 ? 0 : (uint32_t)(((uint64_t)ledTxDelta * 60000ULL) / ledPerfElapsedMs);
  const uint32_t uartTxBytesPerMinute =
    ledPerfElapsedMs == 0 ? 0 : (uint32_t)(((uint64_t)uartTxByteDelta * 60000ULL) / ledPerfElapsedMs);

  lastLedPerfMs = context.nowMs;
  lastLedPerfTx = link.ledTx;
  lastLedPerfAck = link.ledAck;
  lastLedPerfRetry = link.ledRetry;
  lastLedPerfUartTxBytes = uart.txBytes;

  LOG_INFO(
    LogTag::APP,
    "sched loops=%lu tasks=%lu events q=%lu d=%lu drop=%u max=%u seq=%u hw q=%lu x=%lu drop=%u max=%u seq=%u age=%lums",
    (unsigned long)schedulerStats.loopCount,
    (unsigned long)schedulerStats.taskRunCount,
    (unsigned long)eventStats.queued,
    (unsigned long)eventStats.dequeued,
    eventStats.dropped,
    eventStats.maxDepth,
    eventStats.lastSequenceId,
    (unsigned long)hardwareStats.queued,
    (unsigned long)hardwareStats.executed,
    hardwareStats.dropped,
    hardwareStats.maxDepth,
    hardwareStats.lastSequenceId,
    (unsigned long)hardwareStats.maxCommandAgeMs
  );

  LOG_INFO(
    LogTag::APP,
    "OVERRUN count=%lu task=%s runtime=%luus budget=%luus excess=%luus at=%lums maxLoopActual=%luus",
    (unsigned long)schedulerStats.overrunCount,
    schedulerStats.lastOverrunTaskName != nullptr ? schedulerStats.lastOverrunTaskName : "none",
    (unsigned long)schedulerStats.lastOverrunRuntimeUs,
    (unsigned long)schedulerStats.lastOverrunBudgetUs,
    (unsigned long)schedulerStats.lastOverrunExcessUs,
    (unsigned long)schedulerStats.lastOverrunTimestampMs,
    (unsigned long)schedulerStats.maxLoopRuntimeUs
  );

  const LcdDriver::TimingStats &lcdTiming = LcdDriver::timingStats();
  LOG_INFO(
    LogTag::APP,
    "LCD_TIMING clear=%luus row1=%luus row2=%luus frame=%luus setCursor=%luus print=%luus write=%luus maxFrame=%luus ops clear=%lu frame=%lu cursor=%u print=%u write=%u chars=%u rows=%u skipped=%u runs=%u/%u",
    (unsigned long)lcdTiming.clearUs,
    (unsigned long)lcdTiming.row1Us,
    (unsigned long)lcdTiming.row2Us,
    (unsigned long)lcdTiming.frameUs,
    (unsigned long)lcdTiming.setCursorUs,
    (unsigned long)lcdTiming.printUs,
    (unsigned long)lcdTiming.writeUs,
    (unsigned long)lcdTiming.maxFrameUs,
    (unsigned long)lcdTiming.clearCount,
    (unsigned long)lcdTiming.frameUpdateCount,
    (unsigned)lcdTiming.lastFrameSetCursorOps,
    (unsigned)lcdTiming.lastFramePrintOps,
    (unsigned)lcdTiming.lastFrameWriteOps,
    (unsigned)lcdTiming.lastFrameChangedChars,
    (unsigned)lcdTiming.lastFrameRowsChanged,
    (unsigned)lcdTiming.lastFrameRowsSkipped,
    (unsigned)lcdTiming.lastRow1Runs,
    (unsigned)lcdTiming.lastRow2Runs
  );

  LOG_INFO(
    LogTag::APP,
    "UI_TIMING frame=%luus max=%luus decision=%luus data=%luus menu=%luus text=%luus icon=%luus animation=%luus display=%luus spi=%luus built=%lu flushed=%lu skipped=%lu unchanged=%lu full=%lu unnecessary=%lu",
    (unsigned long)uiTiming.frameUs,
    (unsigned long)uiTiming.maxFrameUs,
    (unsigned long)uiTiming.decisionUs,
    (unsigned long)uiTiming.dataUs,
    (unsigned long)uiTiming.menuDrawingUs,
    (unsigned long)uiTiming.textRenderingUs,
    (unsigned long)uiTiming.iconRenderingUs,
    (unsigned long)uiTiming.animationRenderingUs,
    (unsigned long)uiTiming.displayRenderingUs,
    (unsigned long)uiTiming.spiTransferUs,
    (unsigned long)uiTiming.framesBuilt,
    (unsigned long)uiTiming.framesFlushed,
    (unsigned long)uiTiming.framesSkipped,
    (unsigned long)uiTiming.unchangedFrames,
    (unsigned long)uiTiming.fullScreenRedraws,
    (unsigned long)uiTiming.unnecessaryRedraws
  );

  LOG_INFO(
    LogTag::APP,
    "LED_STATE desired=%s/%u/%u/%u active=%s/%u/%u/%u sent=%s/%u/%u/%u pending=%s/%u/%u/%u status=%s retry=%u ackAge=%lums err=%s counts tx=%lu ack=%lu retry=%lu dupIgnored=%lu",
    link.desiredLedMode,
    link.desiredLedPower ? 1 : 0,
    link.desiredLedBrightness,
    link.desiredLedSpeed,
    link.activeLedMode,
    link.activeLedPower ? 1 : 0,
    link.activeLedBrightness,
    link.activeLedSpeed,
    link.lastSentLedMode,
    link.lastSentLedPower ? 1 : 0,
    link.lastSentLedBrightness,
    link.lastSentLedSpeed,
    link.pendingLedMode,
    link.pendingLedPower ? 1 : 0,
    link.pendingLedBrightness,
    link.pendingLedSpeed,
    Esp8266Link::ledStatusName(link.ledStatus),
    link.ledRetryCount,
    link.lastLedAckMs == 0 ? 0UL : (unsigned long)(context.nowMs - link.lastLedAckMs),
    link.lastLedErrReason,
    (unsigned long)link.ledTx,
    (unsigned long)link.ledAck,
    (unsigned long)link.ledRetry,
    (unsigned long)link.ledDuplicateIgnored
  );

  LOG_INFO(
    LogTag::APP,
    "LED_PERF interval=%lums txDelta=%lu ackDelta=%lu retryDelta=%lu txRate=%lu/min uartTxBytesDelta=%lu uartTxBytesRate=%lu/min",
    (unsigned long)ledPerfElapsedMs,
    (unsigned long)ledTxDelta,
    (unsigned long)ledAckDelta,
    (unsigned long)ledRetryDelta,
    (unsigned long)ledTxPerMinute,
    (unsigned long)uartTxByteDelta,
    (unsigned long)uartTxBytesPerMinute
  );

