Neel-729/DeskDroid/firmware/esp32/src/app/application.cpp
  logTaskRuntimeProfiles();
  logOverrunAttributionSummary();

  LOG_INFO(
    LogTag::APP,
    "fault state=%s retry=%u recover=%u reset=%u syncReason=%s last=%s/%s repeat=%u reason=%s counters link=%lu proto=%lu sched=%lu hw=%lu drv=%lu uart tx=%lu/%luB rx=%lu/%luB crc=%lu to=%lu resync=%lu malformed=%lu",
    Esp8266Link::stateName(link.state),
    link.retryCount,
    link.recoveryAttemptCount,
    link.transportResetCount,
    link.lastSyncReason,
    FaultTracker::sourceName(lastFault.source),
    FaultTracker::codeName(lastFault.code),
    lastFault.repeatCount,
    link.lastRecoveryReason,
    (unsigned long)faults.counters.link,
    (unsigned long)faults.counters.protocol,
    (unsigned long)faults.counters.schedulerOverrun,
    (unsigned long)faults.counters.hardwareRequest,
    (unsigned long)faults.counters.driver,
    (unsigned long)uart.txPackets,
    (unsigned long)uart.txBytes,
    (unsigned long)uart.rxPackets,
    (unsigned long)uart.rxBytes,
    (unsigned long)uart.crcErrors,
    (unsigned long)uart.timeoutErrors,
    (unsigned long)uart.resyncCount,
    (unsigned long)uart.malformedPackets
  );
}

void logTaskRuntimeProfiles(){
  logTaskRuntimeRanking(0);
  logTaskRuntimeRanking(1);
  logTaskRuntimeRanking(2);
}

uint64_t taskMetricValue(const ScheduledTask &task, uint8_t metric){
  switch(metric){
    case 0:
      return task.maxRuntimeUs;
    case 1:
      return task.runCount == 0 ? 0 : task.totalRuntimeUs / task.runCount;
    case 2:
      return task.totalRuntimeUs;
  }
  return 0;
}

const char* taskMetricName(uint8_t metric){
  switch(metric){
    case 0:
      return "max";
    case 1:
      return "avg";
    case 2:
      return "total";
  }
  return "unknown";
}

void logTaskRuntimeRanking(uint8_t metric){
  constexpr uint8_t TopTaskLimit = 10;
  constexpr uint8_t MaxProfileTasks = 16;
  bool selected[MaxProfileTasks] = {};
  const uint8_t count = scheduler.taskCount();
  const uint8_t limit = count < TopTaskLimit ? count : TopTaskLimit;

  for(uint8_t rank = 0; rank < limit; ++rank){
    uint8_t bestIndex = 0;
    uint64_t bestValue = 0;
    bool found = false;

    for(uint8_t i = 0; i < count && i < MaxProfileTasks; ++i){
      if(selected[i]) continue;
      const ScheduledTask &task = scheduler.taskAt(i);
      const uint64_t value = taskMetricValue(task, metric);
      if(!found || value > bestValue){
        bestValue = value;
        bestIndex = i;
        found = true;
      }
    }

    if(!found) break;
    selected[bestIndex] = true;

    const ScheduledTask &task = scheduler.taskAt(bestIndex);
    const unsigned long avgRuntimeUs =
      task.runCount == 0 ? 0 : (unsigned long)(task.totalRuntimeUs / task.runCount);
    LOG_INFO(
      LogTag::APP,
      "[TASK_%s] rank=%u task=%s avg=%luus max=%luus last=%luus total=%lluus runs=%lu overruns=%lu budget=%luus overrunTotal=%lluus overrunExcess=%lluus",
      taskMetricName(metric),
      (unsigned)(rank + 1),
      task.name,
      (unsigned long)avgRuntimeUs,
      (unsigned long)task.maxRuntimeUs,
      (unsigned long)task.lastRuntimeUs,
      (unsigned long long)task.totalRuntimeUs,
      (unsigned long)task.runCount,
      (unsigned long)task.overrunCount,
      (unsigned long)task.budgetUs,
      (unsigned long long)task.totalOverrunRuntimeUs,
      (unsigned long long)task.totalOverrunExcessUs
    );
  }
}

void logOverrunAttributionSummary(){
  const SchedulerStats &schedulerStats = scheduler.stats();
  if(schedulerStats.overrunCount == 0){
    LOG_INFO(LogTag::APP, "OVERRUN_ROOT_CAUSE none count=0");
    return;
  }

  const ScheduledTask *leader = nullptr;
  for(uint8_t i = 0; i < scheduler.taskCount(); ++i){
    const ScheduledTask &task = scheduler.taskAt(i);
    if(leader == nullptr || task.overrunCount > leader->overrunCount){
      leader = &task;
    }
  }

  if(leader == nullptr){
    LOG_INFO(LogTag::APP, "OVERRUN_ROOT_CAUSE unknown count=%lu", (unsigned long)schedulerStats.overrunCount);
    return;
  }

  const uint32_t countSharePct =
    (uint32_t)(((uint64_t)leader->overrunCount * 100ULL) / schedulerStats.overrunCount);
  LOG_INFO(
    LogTag::APP,
    "OVERRUN_ROOT_CAUSE task=%s count=%lu share=%lu%% budget=%luus max=%luus avg=%luus overrunTotal=%lluus overrunExcess=%lluus",
    leader->name,
    (unsigned long)leader->overrunCount,
    (unsigned long)countSharePct,
    (unsigned long)leader->budgetUs,
    (unsigned long)leader->maxRuntimeUs,
    (unsigned long)(leader->runCount == 0 ? 0 : leader->totalRuntimeUs / leader->runCount),
    (unsigned long long)leader->totalOverrunRuntimeUs,
    (unsigned long long)leader->totalOverrunExcessUs
  );
}

}

#if OTA_PLATFORM_VALIDATION
void runOtaPlatformValidation() {
  LOG_INFO(LogTag::APP, "========== OTA PLATFORM VALIDATION ==========");
  
  // Test 1 & 5: Boot Test and OTA Capability Detection
  const esp_partition_t *running = esp_ota_get_running_partition();
  const esp_partition_t *boot_partition = esp_ota_get_boot_partition();
  bool partitionsValid = (running != nullptr && boot_partition != nullptr);
  
  if (partitionsValid) {
    LOG_INFO(LogTag::APP, "Boot OK");
    LOG_INFO(LogTag::APP, "Running Partition : %s", running->label);
    LOG_INFO(LogTag::APP, "Boot Partition    : %s", boot_partition->label);
    
    // Get partition subtype info
    LOG_INFO(LogTag::APP, "Running Subtype   : 0x%x", running->subtype);
    LOG_INFO(LogTag::APP, "Boot Subtype      : 0x%x", boot_partition->subtype);
    
    // Count total OTA app partitions
    uint8_t ota_app_count = 0;
    esp_partition_iterator_t iter = esp_partition_find(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, NULL);
    while (iter != NULL) {
      const esp_partition_t *part = esp_partition_get(iter);
      if (part->subtype >= ESP_PARTITION_SUBTYPE_APP_OTA_0 && part->subtype <= ESP_PARTITION_SUBTYPE_APP_OTA_15) {
        ota_app_count++;
      }
      iter = esp_partition_next(iter);
    }
    esp_partition_iterator_release(iter);
    LOG_INFO(LogTag::APP, "Total OTA apps    : %u", ota_app_count);
  } else {
    LOG_INFO(LogTag::APP, "Boot FAILED - Could not get partition info");
  }
  
  // Test 2: Preferences Test
  bool prefsPass = false;
  Preferences validationPrefs;
  if (validationPrefs.begin("ota_validation", false)) {
    // Write test values
    validationPrefs.putInt("test_int", 42);
    validationPrefs.putString("test_str", "DeskDroid OTA test");
    validationPrefs.putBool("test_bool", true);
    
    // Read and verify
    int readInt = validationPrefs.getInt("test_int", 0);
    String readStr = validationPrefs.getString("test_str", "");
    bool readBool = validationPrefs.getBool("test_bool", false);
    
    if (readInt == 42 && readStr == "DeskDroid OTA test" && readBool == true) {
      // Overwrite test
      validationPrefs.putInt("test_int", 84);
      int readInt2 = validationPrefs.getInt("test_int", 0);
      
