Neel-729/DeskDroid/firmware/esp32/src/app/application.cpp
      if (readInt2 == 84) {
        prefsPass = true;
        // Clean up test data
        validationPrefs.remove("test_int");
        validationPrefs.remove("test_str");
        validationPrefs.remove("test_bool");
      }
    }
    validationPrefs.end();
  }
  LOG_INFO(LogTag::APP, "Preferences       : %s", prefsPass ? "PASS" : "FAIL");
  
  // Test 3: Filesystem Test
  bool fsPass = false;
  if (SPIFFS.begin(true)) {
    File testFile = SPIFFS.open("/ota_test.txt", "w");
    if (testFile) {
      const char* testData = "DeskDroid SPIFFS OTA validation test";
      size_t bytesWritten = testFile.write((const uint8_t*)testData, strlen(testData));
      testFile.close();
      
      if (bytesWritten == strlen(testData)) {
        File readFile = SPIFFS.open("/ota_test.txt", "r");
        if (readFile) {
          size_t fileSize = readFile.size();
          uint8_t* buffer = new uint8_t[fileSize];
          size_t bytesRead = readFile.read(buffer, fileSize);
          readFile.close();
          
          if (bytesRead == fileSize && memcmp(buffer, testData, fileSize) == 0) {
            fsPass = true;
          }
          delete[] buffer;
        }
        // Clean up
        SPIFFS.remove("/ota_test.txt");
      }
    }
    SPIFFS.end();
  }
  LOG_INFO(LogTag::APP, "Filesystem        : %s", fsPass ? "PASS" : "FAIL");
  
  // Test 6: Memory Validation
  uint32_t freeHeap = ESP.getFreeHeap();
  uint32_t sketchSize = ESP.getSketchSize();
  uint32_t flashSize = ESP.getFlashChipSize();
  LOG_INFO(LogTag::APP, "Heap              : %u bytes", freeHeap);
  LOG_INFO(LogTag::APP, "Sketch Size       : %u bytes", sketchSize);
  LOG_INFO(LogTag::APP, "Flash Size        : %u bytes", flashSize);
  
  // Overall result
  bool overallPass = partitionsValid && prefsPass && fsPass;
  LOG_INFO(LogTag::APP, "Validation Result : %s", overallPass ? "PASS" : "FAIL");
  LOG_INFO(LogTag::APP, "=============================================");
}
#endif

namespace Application {

void setup(){
  initHardware();
  TimerFeature::begin();

  while(!bootAnimation(millis())){
    flushUiFrame();
    HardwareRequests::executePending();
    AudioService::service();
  }
  flushUiFrame();

  const unsigned long now = millis();
  ClockFeature::begin(now);
  HardwareRequests::clearDisplay();
  UiScreens::clearFrame();
  lastUiFrameValid = false;
  scheduler.reset(now);
  LOG_INFO(LogTag::APP, "DeskDroid %s ready with %u scheduled tasks", FIRMWARE_VERSION, scheduler.taskCount());
#if OTA_PLATFORM_VALIDATION
  runOtaPlatformValidation();
#endif
}

void loop(){
  scheduler.run(millis());
  delay(1);
}

}